# Как реализовать поведение сгенерированных персонажей (и союзиков вне сюжета)

Написать нейронку  
Архитектура простая  
Атомами являются не буквы, а слова  
Словарь очень маленький, вручную отсортированный по смыслам (пара сотен слов)  
Таким образом, можно выделить довольно большой контекст на весь диалог, оставляя нейронку в пределах любого железа (+- 300 слов)

Для каждого слова есть параметры (прошлое настоящее будущее) (множественное число | единственное число)

Также в словаре находятся служебные слова типа {player_name} {place_id} {from_player_hit} {to_player_hit} {run_away} etc...

Нейронка не выключается при завершении диалога, служебные команды передаются как предложения.  
Служебные команды могут как отправляться нейронкой, так и приниматься : ({from_player_hit} -> зачем ты меня ударил? -> {from_player_hit} -> {to_player_hit})  
Контроллер npc детектит выходные служебные команды и принимает решение на их основе.  
Входные соответственно приходят через контроллер npc и передаются в контекст.

## Нейросеть состоит из 5 основных компонентов:

- Семантический анализатор - один слой, который принимает raw слово и на выходе дает 2д вектор (нужен для доп сортировки и уменьшения дискретизации).
- Поведенческое ядро - нейросеть, которая содержит основной контекст и генерирует raw слова (предложениями либо отдельными словами, пока не знаю) из словаря (с временными указателями и числом)
- Пирамида памяти:
    - Долговременный контекст - содержит примерное описание событий (просто словами из словаря), гораздо короче основного контекста.
    - Супер долговременный контекст - содержит очень примерное описание событий (особый словарь, который содержит не отдельные слова, а целые цепочки событий одним атомом), гораздо меньше долговременного контекста.
    - Маленькая нейросеть для генерации долговременного контекста (принимает на вход долговременный контекст и последние вытесненные данные из основного контекста (например каждые 50 слов), полностью заменяет долговременный контекст своим выходом).
    - Маленькая нейросеть для генерации супер долговременного контекста (принимает на вход долговременный контекст)
        - Каждое событие имеет коэффициент важности, его выдает нейросеть для генерации. Также она выдает коэффициент забывания события. Коэффициент забывания уменьшает коэффициент важности каждый тик. Когда приходит новое событие в контекст, ищется наименее важное событие и если событие менее важное, чем новое - новое перезаписывает его. Некоторые события из-за коэффициента не могут быть забыты никогда.
- Лингвист - маленькая нейросеть, которая получает на вход предложение и делает его человекочитаемым (добавляет склонения и т.д).
- Ведущий - маленькая нейросеть, которая придумывает варианты ответов игрока на основе выходного предложения.
